# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Не забудьте, что функция len подходит и для множести.

print(len(set(input().split())))